{
    "id": "imperial_knights",
    "name": "Imperial Knights",
    "keywords": [
      "Imperium",
      "Vehicle",
      "Walker"
    ],
    "rules": [
        {
            "name": "Code Chivalric",
            "lore": "Imperial Knights fight by a stringent set of codes to ensure that in addition to defeating the enemy, honor is always upheld.",
            "text": "At the start of the battle, select one of the Chivalric Oaths below. Your army gains the stated Oath Ability. If, at the start of a Battle Round, the corresponding Deed is completed, your army becomes \"Honored\" and you gain +3 Command Points (limit once per battle).\n\n### Lay Low the Tyrant\n\n* **Oath Ability:** Each Activation, this model may re-roll one Hit roll and one Wound roll.\n* **Deed:** Destroy the enemy +Warlord+.\n\n### Reclaim the Realm\n\n* **Oath Ability:** Add 1\" to this model's Movement trait and add 1 to this model's Advance and Charge rolls.\n* **Deed:** Control one or more objective markers in your opponent's deployment zone."
        },
        {
            "name":"Bondsman",
            "text":"Some +Imperial Knights+ have a \"Bondsman\" ability. When such a unit is Activated, select a friendly +Armiger+ unit within 12\" of the Activated unit. The Bondsman ability is applied to that unit. Units may not be affected by more than one Bondsman ability at a time."
        },
        {
            "name":"Super-Heavy Walker",
            "text":"When a model with this ability makes a Normal, Advance, or Fall Back movement, it may move through other models (excluding +Titanic+ models) and terrain features. If it moves through a terrain feature 5\" tall or higher, it must take a Battle-Shock test after moving."
        }
    ],
    "strategems": [
        {
            "name": "Armor of Contempt",
            "cost": 1,
            "when": "Immediately after an enemy unit has declared a Ranged or Melee attack",
            "target": "Your unit being attacked",
            "effect": "Until the end of the Battle Round, your unit has +1 to its Saving Rolls."
        }
    ],
    "color":"004488"
}
