{
    "name": "Librarius Conclave",
    "secondary_faction":"",
    "banned_keywords": [],
    "rules": [ 
        {
            "name": "Psychic",
            "lore": "Librarians spend their lives mastering psychic disciplines, learning how to manipulate the energies of the Immaterium to confound their foes and embolden their battle‑brothers.",
            "text": "At the start of the battle round, select one of the following Psychic Disciplines. Until the end of the battle round, that Psychic Discipline is active and its effects apply to all +Adeptus Astartes+ +Psyker+ units from your army (and their attached +Bodyguard+ units, if any).",
            "options": [
                {
                    "name": "Biomancy Discipline",
                    "text": "Add 2\" to the Movement trait of all models in this unit."
                },
                {
                    "name": "Divination Discipline",
                    "text": "When making attacks, this unit may re-roll Hit rolls of 1 and Wound rolls of 1."
                },
                {
                    "name": "Pyromancy Discipline",
                    "text": "Ranged attacks made by this unit against enemies within 12\" have their Armor Break trait improved by 1."
                },
                {
                    "name": "Telekinesis Discipline",
                    "text": "Ranged attacks made against this unit have their Strength trait worsened by 1 (to a minimum of 0)."
                },
                {
                    "name": "Telepathy Discipline",
                    "text": "Each time a model in this unit makes an attack, you can ignore any or all modifiers to that attack’s traits or rolls."
                }
            ]
        }
    ],
    "spells": [
        {
            "name": "Assail",
            "difficulty": 8,
            "effect": "Select one visible enemy unit within 18\". Roll six d6. For each result of 5+, the enemy unit suffers 1 mortal damage. If the Telekinesis Discipline is active, the enemy unit suffers 1 mortal damage for each result of 4+ instead."
        },
        {
            "name": "Sensory Assault",
            "difficulty": 7,
            "effect": "Select one visible enemy unit within 18\". Until the end of the Battle Round, it has -2\" to its Movement trait and -2 to its Charge rolls. If the Telepathy Discipline is active, it must also take a Battle-Shock test with a modifier of -1."
        },
        {
            "name": "Fiery Shield",
            "difficulty": 8,
            "effect": "Select a friendly +Adeptus Astartes+ +Infantry or +Adeptus Astartes+ +Mounted+ unit within 18\". Until the end of the Battle Round, attacks targeting the selected unit have -1 to the Hit roll. If the Pyromancy Discipline is active, until the end of the Battle Round, ranged weapons targeting the selected unit have +[Hazardous]+."
        },
        {
            "name": "Iron Arm",
            "difficulty": 7,
            "effect": "Select a friendly +Adeptus Astartes+ +Infantry unit within 18\". Until the end of the Battle Round, add 1 to the Strength trait of weapons equipped by the selected unit. If the Biomancy Discipline is active, add 2 instead."
        },
        {
            "name": "Prescient Precision",
            "difficulty": 8,
            "effect": "Weapons equipped by models in this unit have +[Lethal Hits]+. If the Divination Discipline is active, weapons equipped by models in this unit also have +[Ignores Cover]+"
        }
    ],
    "strategems": [
        {
            "name": "Obfuscation",
            "cost": 1,
            "when": "Immediately after an enemy unit has declared use of the Fire Overwatch strategem.",
            "target": "The enemy unit using Fire Overwatch",
            "effect": "The effects of the Fire Overwatch strategem do not resolve. The enemy player rolls d6; on a result of 5+ the CP cost of their Fire Overwatch strategem is refunded."
        },
        {
            "name": "Quick Study",
            "cost": 1,
            "when": "Before or after your unit's Activation",
            "target": "Your +Adeptus Astartes+ army",
            "effect": "Select a different Discipline to be active for your Army for the remainder of the Battle Round."
        }
    ]
}
