{
    "name": "Unforgiven Task Force",
    "color": "005221",
    "secondary_faction":"Dark Angels",
    "banned_keywords": [],
    "rules": [ 
        {
            "name": "The Red Thirst",
            "lore": "Though they strive to restrain it, the murderous ferocity of the Blood Angels simmers beneath the surface of their thoughts. In battle, this rage drives them towards the foe and lends great strength to their blows.",
            "text": "Whenever a friendly +Adeptus Astartes+ is Battle-Shocked, the Objective Control trait of models in that unit is 1, instead of 0."
        }
    ],
    "spells": [
        {
            "name": "Mind Worm",
            "difficulty": 7,
            "effect": "Select an enemy unit within 18\". It suffers 1 mortal damage. If it has not yet been Activated yet this Battle-Round, it must be activated last this Battle-Round. If it has already been Activated this Battle-Round, it must be Activated last during the next Battle-Round instead."
        },
        {
            "name": "Trephination",
            "difficulty": 7,
            "effect": "The nearest visible enemy unit within 18\" takes a Leadership test. If the test is passed, it suffers d3 mortal damage. If the test is failed, it suffers 3 mortal damage instead."
        },
        {
            "name": "Engulfing Fear",
            "difficulty": 8,
            "effect": "Select one enemy unit within 24\". Until the end of the Battle Round: its models' Leadership trait is worsened by 1, its models Objective Control trait is worsened by 1 (to a minimum of 1), its +Secure Objectives+ ability (if any) is disabled, and the unit must pass a Leadership test to perform any actions."
        }
    ],
    "strategems": [
        {
            "name": "Unforgiven Fury",
            "cost": 1,
            "when": "Your unit's Activation",
            "target": "Your unit being Activated",
            "effect": "Weapons equipped by models in the unit gain +[Lethal Hits]+. Additionally, if any of your units are Battle-Shocked, unmodified Hit rolls of 5+ score a Critical Hit."
        },
        {
            "name": "Grim Retribution",
            "cost": 1,
            "when": "After an enemy Unit has resolved a Shoot action",
            "target": "A friendly +Adeptus Astartes+ unit in your army that had one or more of its models killed as a result of the attack.",
            "effect": "Your targeted unit may Shoot at the enemy unit that just resolved its Shoot action."
        }
    ]
}
