{
    "name": "Renegade Raiders",
    "secondary_faction":"Red Corsairs",
    "rules": [ 
        {
            "name": "Raiders and Reavers",
            "lore": "Some Heretic Astartes warbands are piratical by nature, launching swift attacks focused on destroying their foes in a storm of bloody violence, seizing territory and spoils bnefore the enemy can bring reinforcements to bear.",
            "text": "Ranged weapons equipped by +Heretic Astartes+ models in your army have +[Assault]+. All attacks made against enemy units within range of an objective marker have their Armor Break trait improved by 1."
        }
    ],
    "restrictions":[],
    "spells": [
        {
            "name": "Veil of Time",
            "difficulty": 7,
            "effect": "Select one friendly unit with in 18\". Until the end of the Battle Round, you may re-roll Advance and Charge rolls made for that unit."
        },
        {
            "name": "Fury of the Ancients",
            "difficulty": 7,
            "effect": "Select one visible enemy Model within 18\". Draw a line between any part of this model's base and any part of the selected model's base (or hull). The selected model's unit, and every other enemy unit that this line passes over or through, suffers 1 Mortal Damage"
        },
        {
            "name": "Psychic Fortress",
            "difficulty": 7,
            "effect": "Until the end of the Battle Round, friendly units within 6\" have a 5++ Invulnerable Save."
        }
    ],
    "strategems": [
        {
            "name": "Eternal Hate",
            "cost": 1,
            "when": "Immediately after an enemy unit selects a Fight target.",
            "target": "Your unit being attacked",
            "effect": "Until the end of the Battle Round, each time a model in your unit is destroyed, roll d6, adding 1 to the result if it is a +Khorne+ unit. On a 4+, the destroyed models fight back before being removed from play."
        },
        {
            "name": "Skinshift",
            "cost": 1,
            "when": "At the start of the Battle Round",
            "target": "One friendly +Heretic Astartes+ unit",
            "effect": "One model in your unit regains up to 3 Health. In addition, if your unit is a +Tzeentch+ unit below starting strength, one destroyed non-+Character+ model is returned to your unit at full Health."
        },
        {
            "name": "Dark Obscuration",
            "cost": 1,
            "when": "Immediately after an enemy unit selects a Shoot target",
            "target": "Your unit being attacked",
            "effect": "Until the end of the Battle Round, your unit has the Stealth ability. In addition, if your unit is a +Nurgle+ unit, your unit can only be selected as the target of a ranged attack if the attacking model is within 18\"."
        },
        {
            "name": "Unnatural Swiftness",
            "cost": 1,
            "when": "Your unit Activation",
            "target": "Your unit being Activated",
            "effect": "For this Activation, your unit may Shoot or Charge after making a Fall Back move. In addition, if your unit is a +Slaanesh+ unit, your unit may Shoot or Charge after making an Advance move."
        },
        {
            "name": "Profane Zeal",
            "cost": 1,
            "when": "Your unit Activation",
            "target": "Your +Chaos Undivided+ unit being activated",
            "effect": "Until the end of the Activation, whenever your unit makes an attack, you may re-roll the Wound roll."
        }
    ]
}
