{
    "id": "astra_militarum",
    "name": "Astra Militarum",
    "lore": "The Astra Militarum is the sledgehammer of the Emperor, and its countless armies form the vast majority of the Imperium’s military might. Although often outclassed in terms of strength and technological advancement, the warriors and vehicles of the Imperial Guard stand together, relentlessly wearing down their enemies until nothing is left but a cratered wasteland.",
    "keywords": ["Imperium"],
    "rules": [
        {
        "name": "Voice of Command",
        "lore": "Raised and trained to instil unwavering obedience, officers of the Imperial Guard command authority and respect, and issue orders with imperious bellows that cut through the clamour of war.",
        "text": "At the start the Battle Round, +Officer+ models with this ability can issue an Order to friendly units within 6\". The Order is in effect until the end of the Battle Round. Units may only ever be affected by one Order at a time. Orders may not be issued to Battle-Shocked units, and units which become Battle-Shocked lose the benefits of any Orders.\n\n**Move! Move! Move!** - Increase the unit's Movement trait by 3\".\n\n**Fix Bayonets!** - The unit has +1 to the Hit roll for all melee attacks.\n\n**Take Aim!** - The unit has +1 to the Hit roll for all ranged attacks.\n\n**Open Fire!** - Increase the Attacks trait of +[Rapid Fire X]+ weapons equipped by the unit by 1.\n\n**Take Cover!** - Improve the Save trait of models in this unit by 1 (limit 3+).\n\n**Duty and Honor!** - Improve the Leadership and Objective Control traits of models in this unit by 1."
        }
    ],
    "upgrades":[
        {
            "name":"Death Mask",
            "cost":10,
            "text":"Units led by an +Officer+ which are Battle-Shocked have their Objective Control trait reduced by 1 instead of set to 0."
        },
        {
            "name":"Drill Commander",
            "cost":20,
            "text":"Units led by an +Officer+ which Remain Stationary score Critical Hits for their ranged attacks on an unmodified Hit roll of 5+."
        },
        {
            "name":"Kurov's Aquila",
            "cost":40,
            "text":"Enemy Strategems cost 1 CP more when targeted at units within 12\" of your +Warlord+."
        }
    ],
    "strategems": [
        {
            "name": "Armor of Contempt",
            "cost": 1,
            "when": "Immediately after an enemy unit has declared a Ranged or Melee attack",
            "target": "Your unit being attacked",
            "effect": "Until the end of the Battle Round, your unit has +1 to its Saving Rolls."
        }
    ],
    "color":"4b5320"
}